Revit 2026 API

# StructuralAssetMinimumYieldStress Property

---

The minimum yield stress of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MinimumYieldStress { get; set; }
```
```vb
Public Property MinimumYieldStress As Double
	Get
	Set
```
```cpp
public:
property double MinimumYieldStress {
	double get ();
	void set (double value);
}
```
```fsharp
member MinimumYieldStress : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be Metal or generic to set this property. |

Applies to Metal-based and generic structural assets. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace